Revit 2026 API

# InitialIntensity Class

---

This class is the base class for calculating lighting initial intensity.

SystemObject Autodesk.Revit.DB.LightingInitialIntensity Autodesk.Revit.DB.LightingInitialFluxIntensity Autodesk.Revit.DB.LightingInitialIlluminanceIntensity Autodesk.Revit.DB.LightingInitialLuminousIntensity Autodesk.Revit.DB.LightingInitialWattageIntensity

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class InitialIntensity : IDisposable
```
```vb
Public Class InitialIntensity
	Implements IDisposable
```
```cpp
public ref class InitialIntensity : IDisposable
```
```fsharp
type InitialIntensity =
    class
        interface IDisposable
    end
```

The InitialIntensity type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | InitialIntensityValue | The calculated initial intensity value. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the InitialIntensity derived object. |
|  | Dispose | Releases all resources used by the InitialIntensity |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Lighting Namespace